; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	image3 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 image1)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Star7 image3)
	(have_image Phenomenon8 image1)
	(have_image Planet9 infrared2)
	(have_image Star10 image1)
	(have_image Star11 infrared2)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 infrared2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
2. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 8
3. (turn_to satellite2 star10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star10)
   goals met: 0 of 8
4. (take_image satellite2 star10 instrument5 image1)
   added: (have_image star10 image1)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation3 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon8 instrument5 image1)
   added: (have_image phenomenon8 image1)
   goals met: 2 of 8
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 8
9. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 8
10. (turn_to satellite0 groundstation5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation5)
   goals met: 3 of 8
11. (turn_to satellite1 planet12 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet12)
   goals met: 3 of 8
12. (take_image satellite1 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 4 of 8
13. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 4 of 8
14. (take_image satellite1 planet13 instrument2 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 5 of 8
15. (turn_to satellite1 planet9 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet9)
   goals met: 5 of 8
16. (take_image satellite1 planet9 instrument2 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 6 of 8
17. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 6 of 8
18. (take_image satellite1 star11 instrument2 infrared2)
   added: (have_image star11 infrared2)
   goals met: 7 of 8
19. (turn_to satellite1 star7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star7)
   goals met: 7 of 8
20. (take_image satellite1 star7 instrument2 image3)
   added: (have_image star7 image3)
   goals met: 8 of 8
